import React, {Component} from 'react';

export default function Agreement() {
  return (<div className='modal'>
      <div className="dialog">
        <div className="title1">巴乐兔服务与隐私协议</div>
        巴乐兔服务协议（以下简称本协议）由上海万间信息技术有限公司（以下简称本公司）和您（承租人）签订。
        <div className="title2">一、声明与承诺</div>
        （一）您确认，在您注册成为巴乐兔用户以接受本服务前，或您以本公司允许的其他方式实际使用本服务前，您已充分阅读、理解并接受本协议的全部内容，一旦您使用本服务，即表示您同意遵循本协议之所有约定。
        <br/>（二）您同意，本公司可对本协议内容进行单方面的变更，并以公告的方式予以公布，您可以通过巴乐兔客户端（即APP）/公司网站/微信服务号等途径查阅；若您在本协议内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议内容，也将遵循修改后的协议内容使用本服务；若您不同意修改后的协议内容，您应停止使用本服务。
        <br/>（三）您保证，在您同意接受本协议并注册成为巴乐兔用户时，您已经年满18周岁。如您不具备前述条件，您应终止注册或停止使用本服务。对于未满18周岁的您在接受本协议时未能按照本协议提醒而终止注册或停止使用本服务所造成的法律问题和相应损失（如有）均由您自行承担。
        <div className="title2">二、巴乐兔账户</div>
        （一）注册相关
        <br/>除本协议另有约定或相关产品另有规定外，您须在本公司巴乐兔客户端、微信服务号、公司网站等渠道注册并取得本公司提供给您的巴乐兔账户。您同意：
        <br/> 1、按照本公司要求准确提供并在取得该账户后及时更新您正确、最新及完整的身份信息及相关资料。
        <br/> 2、您应当准确提供并及时更新您的电子邮件地址、联系电话等联系方式及身份证、银行卡等信息，以便本公司与您进行及时、有效联系。
        <br/> 3、您确认，只有您本人可以使用您的巴乐兔账户，凡以您的账号登录巴乐兔平台所作出的任何指令或行为均视为您本人的行为，由您本人承担责任及后果。
        <br/>（二）账户安全
        <br/>您将对使用该账户或密码进行的一切操作及行为负完全的责任，您同意：
        <br/>1、您应当对该等密码、身份信息等进行妥善保管，对于因密码、身份信息、校验码等泄露所致的损失由您自行承担。
        <br/>2、您同意，如您发现有他人冒用或盗用您的巴乐兔登录名及密码或任何其他未经合法授权之情形，或发生与巴乐兔账户关联的手机或其他设备遗失或其他可能危及到巴乐兔账户资金安全情形时，应立即以有效方式通知本公司，向本公司申请暂停相关服务。
        <br/> 3、除非征得本公司同意，否则您的巴乐兔登录名及密码、巴乐兔账户不得以任何方式转让、赠与或继承（相关的财产权益除外）。
        <br/>（三）注销相关
        <br/>若需终止使用本服务，您可以申请注销您的巴乐兔账户，您同意：
        <br/>1、您所申请注销的巴乐兔账户应当是您本人的账户。您应当依照本公司规定的程序进行巴乐兔账户注销。
        <br/> 2、巴乐兔账户注销将导致本公司终止为您提供本服务，本协议约定的双方的权利义务终止，但依本协议其他条款另行约定不得终止的或依其性质不能终止的除外。
        <br/>3、您申请注销的巴乐兔账户应当不存在任何由于该账户被注销而导致的未了结的合同关系与其他基于该账户的存在而产生或维持的权利义务，及本公司认为注销该账户会由此产生未了结的权利义务而产生纠纷的情况。
        <div className="title2">三、授权条款</div>
        1、您理解并同意，您注册使用巴乐兔时，即授权本公司根据您所提供的各项信息及本公司独立获得的信息评定您在本公司所拥有的个人信用额度，或决定是否审核通过您的服务申请。
        <br/>2、您理解并同意，您向本公司授权您的信用卡账单邮箱，本公司将可能读取您所授权的邮箱中的相关信息。
        <br/>3、您理解并同意，您向本公司授权您的学信网账户，本公司将可能通过您的学信网账户查看并读取您的学籍信息；如您在授权时尚未注册学信网账户，本公司将基于您的授权代您申请注册学信网账户；若你提供学历号，本公司将直接查询。
        <br/>4、您理解并同意，您向本公司提交、绑定及授权您的银行卡信息／账户，本公司将可能:
        <br/>1）查询并核对您的账户信息。
        <br/>2）查询并读取您银行卡账户中的交易信息。
        <br/>3）基于您所授权或绑定的银行卡账户进行代收与代付服务。
        <br/>5、您理解并同意，您向本公司授权您的淘宝网或其他服务账号（包括但不限于微博、微信、QQ、京东、支付宝等），本公司将可能读取您所授权的账号中的相关信息。
        <br/>6、您理解并同意，您注册或使用巴乐兔时，本公司将可能依据《征信业管理条例》及相关法律法规，向第三方支付/征信/金融机构合法了解、获取、核实您的信用信息。所获取的个人信用信息仅在巴乐兔业务中使用，且不向其他机构、个人提供或披露。
        <br/>7、您理解并同意，如本公司为您提供了巴乐兔相关服务，您应当依据本公司出具的账单按期向本公司还款，本公司有权通过短信、电话、社交账号等途径对您进行服务与还款提醒。您理解并同意，如您未按期履行还款义务，您的个人逾期信息将可能向第三方进行分享或公布。
        <div className="title2">四、巴乐兔服务及限制</div>
        （一）在使用巴乐兔服务前，您需符合下列要求：
        <br/>1、您使用该服务符合当地的法律法规，并能独立承担法律责任。
        <br/> 2、您已提供您本人真实、有效、完整和最新的身份资料、联系方式、注册信息等，且承诺会尽快补全信用认证或相关信息认证。
        <br/>3、您已开设了有效的银行账户，并将其与巴乐兔银行卡服务绑定（在您同意接
        受本协议时，您所提供的银行卡账户为您本人名下账户）。
        <br/>（二）巴乐兔服务包括但不限于：租赁交易撮合、信用评估、租金分期、定金代收代付、租金代收代付等，具体以本公司当时提供的服务内容为准。
        <br/> 1、租赁交易撮合：本公司已经与若干公寓/房屋开展合作，并在巴乐兔平台展示待出租的公寓/房屋信息，供您选择和参考。您可通过巴乐兔平台选择、匹配合适的出租房源，并通过巴乐兔平台完成租赁合同签约、入住及租约管理等手续。
        <br/> 2、信用评估：信用评估服务是指本公司为您提供的通过读取和分析包含但不限于您通过巴乐兔客户端所提交的个人材料、公开信息、您所授权的邮箱、社保公积金等账号信息及其他授权信息来形成您的个人信用等级，并据此授予您房租分期信用额度的服务。
        <br/>3、租金分期：
        <br/>1）在符合本公司规定及产品规则的情况下，本公司在您通过巴乐兔账户所提交且审核通过的租赁合同（您与房屋出租人就房屋租赁事宜签署的相关协议之统称）之租金范围内提供分期服务，即由本公司及/或本公司合作的第三方机构（包括但不限于本公司合作的互联网金融平台等）为您垫付租金，并直接将垫付款项支付到租赁合同之出租人账户，以满足您的房租分期需求。
        <br/>2）本公司为您提供了分期服务后，本公司将在账单到期日或租赁合同约定还租日，通过您所绑定的银行账户或其他账户，向您收取分期款项。您通过巴乐兔账户支付的租金及相关款项均归本公司所有，且未经本公司同意，您不得与出租人擅自变更、解除租赁合同。
        <br/>3）您理解并同意，本公司有权根据您所提供的各项信息，决定是否为您提供租金分期服务。本公司如接受您的租金分期申请，租金分期总额为：您月付租金金额*分期期数（1个月为1期）。本公司直接将分期租金支付至出租人指定账户，您需在本公司账单日或租赁合同约定的还租日通过巴乐兔平台按时向本公司支付租金。若逾期没有支付的，本公司有权代为行使包括但不限于解除租赁合同等的相关权利。
        <br/>4）您理解并同意，如您申请的租金分期服务资金系本公司合作的第三方机构提供：
        <br/>a、您同意：由本公司全权代为办理与上述租金分期相关的一切手续，包括但不限于代为签署融资文件、代收款项、协助还款等一切手续。
        <br/>b、您同意：租金分期资金审批通过后，由第三方机构将资金划转至本公司账户，并由本公司转付出租人或按租金分期用途处理。
        如本公司需向您及/或出租人收取相关费用的，本公司有权在转付资金时扣除相关费用，并由您本人承担责任，租金分期本金仍按第三方机构划拨的金额计算。
        <br/>c、您同意：如因第三方机构款项划拨存在滞后，本公司可能提前代您向房东垫付款项，本公司提前垫付款项的行为视为代第三方机构履行作为平台方应负的划拨借款之义务。本公司提前垫付款项后，视为第三方机构履行了借款划拨义务及您已收到了借款，第三方机构此后划拨的款项由本公司自行处理。
        <br/>d、您同意：因申请租金分期导致租金支付期限、支付方式与租赁合同约定不一致，视为您和出租人对租赁合同内容进行了变更，并授权本公司按照变更后的支付期限、支付方式对您上传至“巴乐兔”平台的资料和数据进行修正，并由您本人承担责任。
        <br/>e、您同意：无论您因何种原因未按时足额归还分期租金，本公司可能需向第三方机构垫付资金或可能被第三方机构追索。故一旦您逾期归还分期租金，本公司即有权向您全额追偿，并自您逾期之日起按日以千分之一计算违约金，且本公司向您追索不以本公司向第三方机构实际垫付资金为前提。
        <br/>f、您同意：如因任何原因导致租金分期对应的租赁合同提前终止、解除，您应提前10天以书面形式或通过“巴乐兔”平台告知本公司，并提前归还剩余租金分期款项。
        <br/>g、您明确知晓：本公司对第三方机构的服务内容、服务结果等不承担任何责任（包括但不限于第三方机构拒绝提供分期款项、迟延划拨分期款项等）。
        <br/>h、您同意：您授权本公司代为处理租金分期事宜，相关行为产生的法律责任均由本人承担。
        <br/>4、租金代收代付服务：您同意由本公司代为收取和支付您和出租人之间的租金等应收、应付款项，并承诺由您承担代收代付的后果及责任。
        <br/>（三）巴乐兔服务费用
        <br/>就本公司为您提供的租赁交易撮合、租金代收代付等服务，本公司有权按月向您收取服务费。服务费收费方式如下：
        <br/>您月付租金金额*（1%-8%）/月。具体服务费率在您登录巴乐兔平台点击支付房租时系统将进行页面提示，并由您决定是否接受。如您接受服务费，该服务费需在您通过巴乐兔平台支付月付租金时一并支付。本公司拥有制订及调整服务费之权利，并在调整服务费后，于您登录巴乐兔平台点击支付租金时系统予以提示，您有权选择继续使用或终止本公司为您提供的服务。
        <br/>（四）巴乐兔服务限制
        <br/>提前退租的通知义务：您同意并保证，如存在以下任一情形的，您不得无故变更或解除与出租人签署的租赁合同；如确因客观原因需要提前终止租赁合同的，应通过巴乐兔平台或其他可以明确我司能够收悉的方式，至少提前10个自然日通知到本公司，并经本公司审核确认：
        <br/>A、本公司为您提供了租金分期服务；
        <br/>B、本公司取得了租赁合同项下的租金等应收账款债权；
        <br/>C、本公司提供了本协议约定的其他服务。
        <br/>如您违反上述约定变更或解除租赁合同，应赔偿因此导致本公司的全部损失。
        <div className="title2">五、巴乐兔服务使用规则</div>
        为有效保障您使用本服务时的合法权益，您理解并同意接受以下规则：
        <br/>（一）本公司通过您的巴乐兔账户接受来自您的指令，无论您通过何种方式向本公司发出指令，都不可撤回或撤销，且视为您本人的指令。
        <br/>（二）您应按照本公司的要求完善您的身份信息以最终达到实名，否则本公司有权对您的账户进行冻结，直至您达到实名。您应按照本公司的要求完善您的信用验证，否则本公司有权停止对您的服务并对您的账号进行冻结并对于已经为您提供的服务立即要求您偿还及补偿。请您保证您信息的真实性，若被检测出虚假信息，系统将会采取拒绝措施，若涉嫌恶意信息作假或盗用他人信息，将可能记入网络征信系统，影响您的征信记录，同时本公司将保留追究您相应法律责任的权利。
        <br/>（三）本协议项下的资金收付、结算均通过银行或第三方支付公司来实现，你理解并同意您的资金于流转途中的合理时间。
        <br/>（四）交易风险因您的过错导致的任何损失由您自行承担，该过错包括但不限于：不按照交易提示操作，未及时进行交易操作，遗忘或泄漏密码、校验码等，密码被他人破解。
        <br/>（五）您与出租人就租赁合同履行产生的任何争议，包括但不限于租赁房屋及设施的维护、租金及相关费用发票的开局等，均由您与出租人自行协商处理，本公司对租赁合同的履行不承担任何义务和责任。
        <div className="title2">六、巴乐兔服务使用限制</div>
        （一）您在使用本服务时应遵守中华人民共和国相关法律法规、您所在国家或地区之法令及相关国际惯例，不将本服务用于任何非法目的，也不以任何非法方式使用本服务，否则本公司有权拒绝提供本服务，或提前终止协议并追回借款，且您应承担所有相关法律责任。
        <br/>（二）您不得利用本服务从事侵害他人合法权益之行为，否则本公司有权拒绝提供本服务，且您应承担所有相关法律责任，因此导致本公司或本公司雇员或其他方受损的，您应承担赔偿责任。上述行为包括但不限于:
        <br/>1、侵害他人名誉权、隐私权、商业秘密、商标权、著作权、专利权等合法权益。
        <br/>2、违反依法定或约定之保密义务。
        <br/>3、冒用他人名义使用本服务。
        <br/>4、从事不法交易行为。
        <br/>5、未按时履行还款义务。
        <br/>6、提供骗贷资讯或以任何方式引诱他人参与骗贷。
        <br/>7、非法使用他人银行账户或无效银行账户交易。
        <br/>8、从事任何可能含有电脑病毒或是可能侵害本服务系统、资料之行为。
        <br/>9、其他本公司有正当理由认为不适当之行为。
        <br/>（三）您理解并同意，本公司不对因下述任一情况导致的任何损害赔偿承担责任:
        <br/>1、本公司有权基于单方判断，包含但不限于本公司认为您已经违反本协议的明文规定及精神，对您的名下的全部或部分巴乐兔账户暂停、中断或终止向您提供本服务或其任何部分，并移除或公布您的资料。
        <br/>2、本公司在发现异常交易或合理怀疑交易有疑义或有违反法律规定或本协议约定之虞时，有权不经通知先行暂停或终止您巴乐兔账户的使用（包括但不限于对账户名下的信用额度和在途交易采取取消交易、调账等限制措施），并拒绝您使用本服务之部分或全部功能。
        <br/>3、您理解并同意，存在如下情形时，本公司有权对您名下巴乐兔账户或交易的进行冻结或追回，且有权限制您所使用的产品或服务的部分或全部功能：
        <br/>1）根据本协议的约定；
        <br/>2）根据法律法规及法律文书的规定；
        <br/>3）根据有权机关的要求；
        <br/>4）您使用巴乐兔服务的行为涉嫌违反国家法律法规及行政规定的；
        <br/>5）本公司基于单方面合理判断认为账户信息、操作等存在异常时；
        <br/>6）本公司依据自行合理判断认为可能产生风险的；
        <br/>7）您在参加市场活动时有批量注册账户、提供虚假信息或材料及其他舞弊等违反活动规则、违反诚实信用原则的；
        <br/>8）错误汇入资金等导致您可能存在不当得利的；
        <br/>9）您未按时履行还款义务的；
        <br/>10）您遭到他人投诉，且对方已经提供了一定证据的。
        <br/>4、如您申请解除上述冻结或限制，您应按本公司要求如实提供相关资料及您的身份证明以及本公司要求的其他信息或文件，以便本公司进行核实，且本公司有权依照自行判断来决定是否同意您的申请。
        <div className="title2">七、隐私权保护</div>
        本公司重视对用户隐私的保护。因收集您的信息是出于遵守国家法律法规的规定以及向您提供服务及提升服务质量的目的，本公司对您的信息承担保密义务，不会为满足第三方的营销目的而向其出售或出租您的任何信息，本公司会在下列情况下才将您的信息与第三方共享：
        <br/>1、获得您的同意或授权。
        <br/>2、某些情况下，只有共享您的信息，才能提供您需要的服务和（或）产品，或处理您与他人的交易纠纷或争议。
        <br/>3、某些服务和（或）产品由本公司的合作伙伴提供或由本公司与合作伙伴共同提供，本公司会与其共享提供服务和（或）产品需要的信息。
        <br/>4、本公司与第三方进行联合推广活动，本公司可能与其共享活动过程中产生的、为完成活动所必要的个人信息，如参加活动的中奖名单、中奖人联系方式等，以便第三方能及时向您发放奖品。
        <br/>5、根据法律法规的规定及有权机关的要求。
        <br/>6、为维护本公司和其他巴乐兔用户的合法权益。
        <br/>7、根据法律规定及合理商业习惯，在本公司计划与其他公司合并或被其收购或进行其他资本市场活动（包括但不限于IPO，债券发行、对外融资等）时，以及其他情形下本公司需要接受来自其他主体的尽职调查时，本公司会把您的信息提供给必要的主体，但本公司会通过和这些主体签署保密协议等方式要求其对您的个人信息采取合理的保密措施。
        <div className="title2">八、系统中断或故障</div>
        本公司系统因维修、故障、黑客攻击、电信部门技术调整或故障、网站升级、银行方面、意外、不可抗力等状况无法正常运作，使您无法使用各项服务时，本公司不承担损害赔偿责任。
        <div className="title2">九、
          责任范围及责任限制</div>
        （一）本公司用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整。
        <br/>（二）本公司不对巴乐兔服务结果及租赁合同各方履行能力及行为提供任何形式的承诺保证。
        <div className="title2">十、商标、知识产权、专利的保护</div>
        （一）本公司及关联公司所有系统及本公司上所有内容，包括但不限于著作、图片、档案、资讯、资料、网站架构、网站画面的安排、网页设计，均由本公司或本公司关联公司依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
        <br/>（二）非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。
        <br/>（三）尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。
        <div className="title2">十一、法律适用与管辖</div>
        本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，并由本公司所在地人民法院管辖。
        <div className="title2">十二、协议生效 </div>
        本协议及附属协议均以电子文本形式制作，自您点击确认后即生效。
      </div>
    </div>
  )
}